<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>WalletCoach &#8211; Maro&#353; Ga&#353;par&iacute;k</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="article"><div class="titlepage"><div><div><h1 class="title"><a name="d5e1"></a>
            WalletCoach &#8211; Maro&#353; Ga&#353;par&iacute;k
        </h1></div></div><hr></div><div class="toc"><p><b>Table of Contents</b></p><dl class="toc"><dt><span class="sect1"><a href="#d5e4">&Uacute;vodn&iacute; motivace</a></span></dt><dt><span class="sect1"><a href="#d5e8">xQuery &#8211; prezenta&#269;n&aacute; forma &uacute;dajov</a></span></dt><dt><span class="sect1"><a href="#d5e11">xQuery &#8211; group by</a></span></dt><dt><span class="sect1"><a href="#d5e17">xQuery a XSLT - reporty</a></span></dt><dt><span class="sect1"><a href="#d5e31">&#268;o mi projekt dal</a></span></dt><dt><span class="sect1"><a href="#d5e34">Aplik&aacute;cia</a></span></dt></dl></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e4"></a>&Uacute;vodn&iacute; motivace</h2></div></div></div><p>Moja pr&aacute;ca na projekte za&#269;ala n&aacute;vrhom u&#382;&iacute;vate&#318;sk&eacute;ho rozhrania aplik&aacute;cie, na ktor&uacute; som pou&#382;il jeden z dostupn&yacute;ch online n&aacute;strojov ur&#269;en&yacute;ch na tvorbu wireframe.  Aj ke&#271; sa kone&#269;n&aacute; podoba aplik&aacute;cie od p&ocirc;vodn&eacute;ho n&aacute;vrhu l&iacute;&#353;i, ur&#269;ite n&aacute;m prvotn&yacute; n&aacute;vrh pomohol lep&#353;ie si predstavi&#357; aplik&aacute;ciu pri jej tvorbe.</p><p>Pri u&#382;&iacute;vate&#318;skom rozhran&iacute; som ostal aj pri &#271;al&#353;ej z mojich &#269;innost&iacute;, ktorou bolo vytvorenie rozhrania priamo vo v&yacute;vojovom prostred&iacute; Netbeans. Pred samotn&yacute;m vlo&#382;en&iacute;m podoby GUI do Netbeans prebehla t&iacute;mov&aacute; diskusia, v ktorej sme brainstormovali nad podobou rozhrania, pri&#269;om sme sa sna&#382;ili p&ocirc;vodn&yacute; n&aacute;vrh upravi&#357; tak, aby vyhovoval na&#353;ej predstave o fin&aacute;lnej podobe programu. N&aacute;vrh rozhrania, ktor&yacute; som vytvoril, bol zameran&yacute; na funk&#269;n&eacute; rozlo&#382;enie jednotliv&yacute;ch prvkov. Grafick&uacute; podobu, ako farby a podobn&eacute; z&aacute;le&#382;itosti, sme rie&#353;ili a&#382; nesk&ocirc;r. Pr&aacute;ca s u&#382;&iacute;vate&#318;sk&yacute;m rozhran&iacute;m nebola n&aacute;ro&#269;n&aacute; a robila sa celkom pr&iacute;jemne. Po n&aacute;vrhu u&#382; sta&#269;ilo jednotliv&eacute; prvky &#8222;naklika&#357;&#8220; do prostredia Netbeans, kde ich n&aacute;sledne Michael prepojil s aplika&#269;nou logikou v Jave.</p></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e8"></a>xQuery &#8211; prezenta&#269;n&aacute; forma &uacute;dajov</h2></div></div></div><p>
            Mojou tre&#357;ou, najd&ocirc;le&#382;itej&#353;ou a takisto aj najn&aacute;ro&#269;nej&#353;ou &#269;innos&#357;ou bola pr&aacute;ca s xQuery a n&aacute;sledne aj XSL Transform&aacute;ciami. Mojou prvou &uacute;lohou bolo pretvorenie xml s&uacute;boru, v ktorom s&uacute; ulo&#382;en&eacute; v&#353;etky v&yacute;dajov&eacute; a pr&iacute;jmov&eacute; polo&#382;ky, do form&aacute;tu zrozumite&#318;n&eacute;ho pre u&#382;&iacute;vate&#318;a. Konkr&eacute;tne sa jednalo o nahradenia inform&aacute;ci&iacute; o kateg&oacute;ri&iacute; a firme (ktor&eacute; s&uacute; v zdrojovom xml s&uacute;bore reprezentovan&eacute; iba svojim) n&aacute;zvom danej kateg&oacute;rie, respekt&iacute;ve firmy. T&aacute;to &#269;innos&#357; bola pre m&#328;a n&aacute;ro&#269;n&aacute; hlavne kv&ocirc;li pr&aacute;ci s viacer&yacute;mi XML s&uacute;bormi (polo&#382;ky, kateg&oacute;rie, firmy) z&aacute;rove&#328;, na &#269;o som z predch&aacute;dzaj&uacute;cich sk&uacute;senost&iacute; s xQuery nebol pripraven&yacute;. Takisto bol v tomto v&yacute;stupnom xml s&uacute;bore preveden&yacute; d&aacute;tum z datetime preveden&yacute; do lep&#353;ie zrozumite&#318;n&eacute;ho form&aacute;tu &#8222;DD. MM. YYYY&#8220;.
        </p></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e11"></a>xQuery &#8211; group by</h2></div></div></div><p>
            &#270;alej som vytvoril xQuery k&oacute;d, ktor&yacute; vyp&iacute;&#353;e sumu v&yacute;dajov pre jednotliv&eacute; dni vo vybranom mesiaci. Na tento &uacute;&#269;el som pou&#382;il &#269;as&#357; xQuery k&oacute;du &#8222;group by&#8220;. V&yacute;sledn&yacute; k&oacute;d vyzeral takto:
        </p><p>
            <code class="code">
                &lt;date day="1" month="1 1 1"&gt;-400 &lt;/date&gt;
            </code>
        </p><p>
            Ke&#271;&#382;e boli vo v&yacute;slednom v&yacute;daji za 1.1. s&#269;&iacute;tan&eacute; viacer&eacute; polo&#382;ky, xQuery za mesiac (fn:month-from-dateTime(datetime)) Nedosadil &#269;&iacute;slo mesiaca iba jeden kr&aacute;t, ale jeden kr&aacute;t za ka&#382;d&uacute; s&#269;&iacute;tan&uacute; polo&#382;ku. Tento probl&eacute;m som odstr&aacute;nil pou&#382;it&iacute;m distinct-values(). Tento k&oacute;d sa d&aacute; pou&#382;i&#357; po malej &uacute;prave aj na v&yacute;pis sumy v&#353;etk&yacute;ch pr&iacute;jmov za dan&eacute; obdobie, respekt&iacute;ve v&yacute;pis sumy v&#353;etk&yacute;ch polo&#382;iek (pr&iacute;jmy + v&yacute;daje).
        </p></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e17"></a>xQuery a XSLT - reporty</h2></div></div></div><p> &#270;alej som pracoval na vytvoren&iacute; reportu, v ktorom s&uacute; zrhnut&eacute; najprv celkov&eacute; pr&iacute;jmy a
            v&yacute;daje za dan&eacute; obdobie, ktor&eacute; s&uacute; n&aacute;sledne rozdelen&eacute; pod&#318;a kateg&oacute;ri&iacute; a pod&#318;a subjektov.
            Vytvorenie tohto reportu prebiehalo v dvoch krokoch:  </p><p>
            </p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>Vytvorenie xml s&uacute;boru so &#353;trukt&uacute;rou reportu</p><p><span class="inlinemediaobject"><img src="../../file:/C:/Users/Michael/Desktop/img.png"></span></p><p>xQuery k&oacute;d na vytvorenie tejto &#353;trukt&uacute;ry bol relat&iacute;vne komplikovan&yacute;, no
                        v&#271;aka sk&uacute;senostiam z predch&aacute;dzaj&uacute;cej pr&aacute;ce s xQuery, ktor&eacute; som po&#269;as pr&aacute;ce
                        na projekte nadobudol, som ho zvl&aacute;dol vytvori&#357; bez &#357;a&#382;kost&iacute;.</p></li><li class="listitem"><p>XSL Transform&aacute;cia na HTML s&uacute;bor, ktor&yacute; obsahoval 3 tabu&#318;ky, jednu
                                pre ka&#382;d&yacute; z elementov &lt;summary&gt;, &lt;categories&gt; a
                                &lt;subjects&gt;. T&aacute;to &uacute;loha bola v&#271;aka kvalite pripraven&eacute;ho XML
                                s&uacute;boru v prvom kroku naozaj jednoduch&aacute;.</p></li></ol></div><p>
        </p></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e31"></a>&#268;o mi projekt dal</h2></div></div></div><p>
            Pr&aacute;ca na projekte bola ve&#318;mi zauj&iacute;mavou sk&uacute;senos&#357;ou. Jednalo sa o m&ocirc;j prv&yacute; projekt riaden&yacute; pomocou kvalitn&yacute;ch n&aacute;strojov ako Github, ktor&yacute; pr&aacute;cu v t&iacute;me naozaj u&#318;ah&#269;il a zlep&#353;il. Nezast&uacute;pite&#318;n&uacute; &uacute;lohu hral v t&iacute;me Michael, ktor&yacute; sa od za&#269;iatku ujal vodcovstva a pripravil n&aacute;vrh aplik&aacute;cie. N&aacute;sledne vyt&aacute;ral v Githube jednotliv&eacute; &uacute;lohy, ktor&eacute; sme s jeho pomocou a koordin&aacute;ciou sp&#314;&#328;ali.    </p></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e34"></a>Aplik&aacute;cia</h2></div></div></div><p>
            Mysl&iacute;m si, &#382;e sme vytvorili kvalitn&uacute; aplik&aacute;ciu, ktor&uacute; budeme minim&aacute;lne my, &#269;lenovia t&iacute;mu, naozaj pou&#382;&iacute;va&#357;. Umo&#382;&#328;uje jednoduch&uacute; a preh&#318;adn&uacute; evidenciu osobn&yacute;ch financi&iacute; a pon&uacute;ka r&ocirc;zne reporty. Mysl&iacute;m si, &#382;e by sme mohli vytvori&#357; &#271;al&#353;ie in&eacute; formy reportov, ktor&eacute; by pr&iacute;nos aplik&aacute;cie pre pou&#382;&iacute;vate&#318;a e&#353;te zv&yacute;&#353;ili.            
        </p></div></div></body></html>