<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Z&aacute;v&#283;re&#269;n&aacute; zpr&aacute;va k projektu WalletCoach</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="article"><div class="titlepage"><div><div><h1 class="title"><a name="d5e1"></a>
            Z&aacute;v&#283;re&#269;n&aacute; zpr&aacute;va k projektu WalletCoach
        </h1></div><div><div class="author"><h3 class="author">Michael Le</h3></div></div></div><hr></div><div class="toc"><p><b>Table of Contents</b></p><dl class="toc"><dt><span class="sect1"><a href="#d5e6">&Uacute;vodn&iacute; motivace</a></span></dt><dt><span class="sect1"><a href="#d5e9">Technick&eacute; informace</a></span></dt><dt><span class="sect1"><a href="#d5e12">Moje role</a></span></dt><dt><span class="sect1"><a href="#d5e15">T&yacute;mov&aacute; spolupr&aacute;ce</a></span></dt><dt><span class="sect1"><a href="#d5e18">Z&aacute;v&#283;r</a></span></dt><dt><span class="sect1"><a href="#d5e21">Technick&eacute; infomrace</a></span></dt></dl></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e6"></a>&Uacute;vodn&iacute; motivace</h2></div></div></div><p>Stimulem ke vzniku projektu WalletCoach byla pot&#345;eba autor&#367; evidovat sv&eacute; osobn&iacute; p&#345;&iacute;jmy a v&yacute;daje. Projekt za&#269;al n&aacute;vrhem seskl&aacute;dan&yacute;m z n&aacute;pad&#367; jednotliv&yacute;ch autor&#367;. Aplikace byla koncipov&aacute;na tedy velice pragmaticky, i vzhledem k p&#345;edm&#283;tu, ke kter&eacute;mu se projekt vztahuje a sna&#382;&iacute; se vyu&#382;&iacute;vat maxim&aacute;ln&#283; dostupn&yacute;ch technologi&iacute; zalo&#382;en&yacute;ch na b&aacute;zi XML.</p></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e9"></a>Technick&eacute; informace</h2></div></div></div><p>
            Jako &uacute;lo&#382;i&#353;t&#283; dat byla vybr&aacute;na XML datab&aacute;ze BaseX s Java rozhran&iacute;m XQJ ve Standalone modu. Rozva&#382;ov&aacute;no bylo i nad jin&yacute;mi datab&aacute;zemi, resp. i nad pouh&yacute;m pou&#382;it&iacute;m parseru Saxon HE. Tyto alternativy nebyly pou&#382;ity z rozli&#269;n&yacute;ch d&#367;vod&#367; (mj. zastaralost, propriet&aacute;rnost atp.). V&yacute;b&#283;r fin&aacute;ln&iacute; technologie bohu&#382;el souvisela s netrivi&aacute;ln&iacute;mi komplikacemi. Jednalo se p&#345;edev&#353;&iacute;m o nekompatibiln&iacute; z&aacute;vislosti mezi r&#367;zn&yacute;mi verzemi BaseX/XQJ/Connection Pool. I p&#345;esto&#382;e bylo nakonec mo&#382;n&eacute; tyto knihovny zprovoznit, za b&#283;hu do&#353;lo k neo&#269;ek&aacute;van&yacute;m komplikac&iacute;m v podob&#283; r&#367;zn&yacute;ch bug&#367; (v&#269;. ji&#382; ohl&aacute;&#353;en&yacute;ch, t&yacute;kaj&iacute;c&iacute;ch se p&#345;ehnan&eacute;ho zamyk&aacute;n&iacute; datab&aacute;z&iacute;).            
        </p></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e12"></a>Moje role</h2></div></div></div><p>
            Moje role byla p&#345;edev&#353;&iacute;m &uacute;prava a synt&eacute;za &#269;&aacute;st&iacute; syst&eacute;mu p&#345;ipraven&yacute;ch jin&yacute;mi &#269;leny t&yacute;mu. Jednotliv&eacute; &uacute;koly byly dekomponov&aacute;ny do nez&aacute;visl&yacute;ch &#269;&aacute;st&iacute; a &#269;len&#367;m zad&aacute;v&aacute;ny pomoc&iacute; Issue Trackeru na GitHubu. D&iacute;ky tomu si &#269;lenov&eacute; mohli sami rozvrhnout, kdy jakou &#269;&aacute;st ud&#283;laj&iacute; (i s ohledem na zkou&#353;kov&eacute; obdob&iacute; a pracovn&iacute; povinnosti), a mohli si i vyzkou&#353;et pracovat na rozli&#269;n&yacute;ch &#269;&aacute;stech syst&eacute;mu. Vrcholem na&#353;&iacute; pr&aacute;ce byla n&#283;kolika denn&iacute; akce zvan&aacute; &#8222;velk&aacute; synt&eacute;za&#8220;, p&#345;i kter&eacute; se &#269;lenov&eacute; st&#345;etli osobn&#283;, aby dokon&#269;ili projekt.            
        </p></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e15"></a>T&yacute;mov&aacute; spolupr&aacute;ce</h2></div></div></div><p>
            S prac&iacute; &#269;len&#367; sv&eacute;ho t&yacute;mu jsem spokojen. V&#353;ichni si samostatn&#283; nastudovali souvisej&iacute;c&iacute; materi&aacute;ly ke sv&eacute; &#269;&aacute;sti a svou &#269;&aacute;st vypracovali. Jako podp&#367;rn&yacute; materi&aacute;l byla &#269;len&#367;m dostupn&aacute;  FIkipedia na b&aacute;zi MediaWiki (http://fikipedia.michael-le.net/walletcoach). 
        </p></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e18"></a>Z&aacute;v&#283;r</h2></div></div></div><p>
            S vypracovanou aplikac&iacute; jsem spokojen, p&#345;esto&#382;e jsme si v&#283;domi n&#283;kter&yacute;ch nedostatk&#367;. Mysl&iacute;m, &#382;e slou&#382;&iacute; dob&#345;e jako p&#345;ehled &#8222;s&iacute;ly&#8220; technologie XML. A s trochou dal&#353;&iacute;ho v&yacute;voje by bylo mo&#382;n&eacute; aplikaci pou&#382;&iacute;t i prakticky. 
        </p></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e21"></a>Technick&eacute; infomrace</h2></div></div></div><p>
            Jako &uacute;lo&#382;i&#353;t&#283; dat byla vybr&aacute;na XML datab&aacute;ze BaseX s Java rozhran&iacute;m XQJ ve Standalone modu. Rozva&#382;ov&aacute;no bylo i nad jin&yacute;mi datab&aacute;zemi, resp. i nad pouh&yacute;m pou&#382;it&iacute;m parseru Saxon HE. Tyto alternativy nebyly pou&#382;ity z rozli&#269;n&yacute;ch d&#367;vod&#367; (mj. zastaralost, propriet&aacute;rnost atp.). V&yacute;b&#283;r fin&aacute;ln&iacute; technologie bohu&#382;el souvisela s netrivi&aacute;ln&iacute;mi komplikacemi. Jednalo se p&#345;edev&#353;&iacute;m o nekompatibiln&iacute; z&aacute;vislosti mezi r&#367;zn&yacute;mi verzemi BaseX/XQJ/Connection Pool. I p&#345;esto&#382;e bylo nakonec mo&#382;n&eacute; tyto knihovny zprovoznit, za b&#283;hu do&#353;lo k neo&#269;ek&aacute;van&yacute;m komplikac&iacute;m v podob&#283; r&#367;zn&yacute;ch bug&#367; (v&#269;. ji&#382; ohl&aacute;&#353;en&yacute;ch, t&yacute;kaj&iacute;c&iacute;ch se p&#345;ehnan&eacute;ho zamyk&aacute;n&iacute; datab&aacute;z&iacute;).            
        </p></div></div></body></html>